Revit 2027 API
Application.ShowGraphicalWarningElectricalDisconnects Property
 Whether or not to show the graphical warnings for Electrical disconnects.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowGraphicalWarningElectricalDisconnects { get; set; }
Public Property ShowGraphicalWarningElectricalDisconnects As Boolean
	Get
	Set
public:
property bool ShowGraphicalWarningElectricalDisconnects {
	bool get ();
	void set (bool value);
}
member ShowGraphicalWarningElectricalDisconnects : bool with get, set
Property Value
Boolean
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace